Public Types | Public Member Functions | List of all members
INavigatorCallbackInterface Struct Referenceabstract
Project Navigator
Callback interface object to register with ACAPI_Navigator_RegisterCallbackInterface. More...
#include <INavigatorCallbackInterface.hpp>
 Inheritance diagram for INavigatorCallbackInterface:
 Public Types
enum  | IconTWMode { TWNormal , TWReserved , TWBeforeSend , TWNotMineBeforeSend }
enum  | IconLinkness {
 Normal , Link , Shortcut , PDFShortcut ,
 DWGShortcut , DXFShortcut , IFCShortcut
 }
enum  | IconSize { NormalSize , Small }
enum  | IconContext { Model , Layout }
enum  | ContextMenuCommand { NewItemCommand , DeleteItemCommand , RenameItemCommand , OpenSettingsCommand }
enum  | TWCommandMenu {
 ReserveNode , ReserveGroupChildren , ReleaseNode , ReleaseGroupChildren ,
 RequestNode
 }
enum  | TWCommandMail { Request1Mail , RequestNMail , Grant1Mail , GrantNMail }
 Public Member Functions
 virtual bool  | IsDummyInterface (void) const
 virtual GSErrCode  | OpenView (const API_Guid &viewPointID, bool newWindow) const =0
 virtual GSErrCode  | OpenSettings (const API_Guid &viewPointID) const =0
 virtual GSErrCode  | ExecuteMergePostProcess () const =0
 virtual GSErrCode  | CreateIDFStore (const API_Guid &viewPointID, double scale, double &clipBoxWidth, double &clipBoxHeight, GSPtr &idfStore, API_Box &boundingBox, double &paddingX, double &paddingY, GS::Array< API_Guid > &elems) const =0
 virtual GSErrCode  | GetElemsForDrawingCheck (const API_Guid &viewPointID, GS::Array< API_Guid > &elems) const =0
 virtual GSErrCode  | NewItem (const API_Guid &viewPointID) const =0
 virtual GSErrCode  | DeleteItem (const GS::Array< API_Guid > &viewPointIDList) const =0
 virtual GSErrCode  | RenameItem (const API_Guid &viewPointID) const =0
 virtual DG::Icon  | GetIcon (Int32 iconId, IconTWMode iconTWMode, IconLinkness linkness, IconSize size, IconContext context) const =0
 virtual bool  | GetContextMenuCommandString (ContextMenuCommand cmd, const API_Guid &viewPointId, GS::UniString &text) const
 virtual bool  | IsContextMenuCommandEnabled (ContextMenuCommand cmd, const API_Guid &viewPointId) const
 virtual bool  | GetTWCommandMenuString (TWCommandMenu cmd, const API_Guid &viewPointId, GS::UniString &text) const
 virtual bool  | GetTWCommandMailString (TWCommandMail cmd, const API_Guid &viewPointId, GS::UniString &text) const
Detailed Description
Callback interface object to register with ACAPI_Navigator_RegisterCallbackInterface.
Since
Archicad 26